package main

/*
Поменять местами два числа без создания временной переменной.
*/

// xor :)
func task13() {
	a := 1
	b := 5

	/*
	  +---+---+---+---+
	  | 0 | 0 | 0 | 1 | <- a
	  +---+---+---+---+
	  | 0 | 1 | 0 | 1 | <- b
	  +---+---+---+---+
	  | 0 | 1 | 0 | 0 | -> a (4)
	  +---+---+---+---+
	*/
	a ^= b

	/*
	  +---+---+---+---+
	  | 0 | 1 | 0 | 0 | <- a
	  +---+---+---+---+
	  | 0 | 1 | 0 | 1 | <- b
	  +---+---+---+---+
	  | 0 | 0 | 0 | 1 | -> b (1)
	  +---+---+---+---+
	*/
	b ^= a

	/*
	  +---+---+---+---+
	  | 0 | 1 | 0 | 0 | <- a
	  +---+---+---+---+
	  | 0 | 0 | 0 | 1 | <- b
	  +---+---+---+---+
	  | 0 | 1 | 0 | 1 | -> a (5)
	  +---+---+---+---+
	*/
	a ^= b

	println(a)
	println(b)
}

// просто математика
func task13_2() {
	a := 1
	b := 5

	a += b
	b = a - b
	a = a - b

	println(a)
	println(b)
}

// синтаксисом
func task13_3() {
	a := 1
	b := 5

	a, b = b, a

	println(a)
	println(b)
}
